package Gallows;

public class WordsStorage {
    private static final String[] WORDS = {
            "СОЛНЦЕ", "ДЕРЕВО", "КНИГА", "МОРЕ", "КОШКА", "СОБАКА", "ДОМ", "СТОЛ", "СТУЛ",
            "КУКЛА", "ПТИЦА", "ЦВЕТЫ", "ОКНО", "ЗВЕЗДА", "МУЗЫКА", "ПРИЯТЕЛЬ", "ШКОЛА",
            "ГОРОД", "РЕКА", "ЛЕС", "ГОРЫ", "ДРУГ", "СЛОН", "МЕДВЕДЬ",
            "СИРЕНЬ", "ТРАВА", "ФРУКТ", "ЯБЛОКО", "ГРУША", "КАРТОФЕЛЬ", "МОРКОВЬ", "ЛУК",
            "ЧЕСНОК", "ОГУРЕЦ", "ПОМИДОР", "САХАР", "СОЛЬ", "ПЕРЕЦ", "МОЛОКО", "ХЛЕБ",
            "КАРТОШКА", "КУРИЦА", "РЫБА", "МЯСО", "СУП", "ЧАЙ", "КОФЕ", "ВОДА", "СИР",
            "ЙОГУРТ", "КОНФЕТА", "ШОКОЛАД", "ПИРОГ", "ТОРТ", "ПИЦЦА", "САЛАТ", "ПАСТА",
            "БЛИНЫ", "ОБЕД", "УЖИН", "ЗАВТРАК", "ПУТЕШЕСТВИЕ", "КАНИКУЛЫ", "ОТПУСК", "РАБОТА",
            "УЧЁБА", "СПОРТ", "ИГРА", "ФИЛЬМ", "КНИГА", "РИСУНОК", "ФОТОГРАФИЯ", "АВТОМОБИЛЬ",
            "КОМПЬЮТЕР", "УНИВЕРСИТЕТ", "ЭЛЕКТРИЧЕСТВО", "ПРИКЛЮЧЕНИЕ", "МУЗЫКАНТ", "ФОТОГРАФИЯ",
            "СОЦИОЛОГИЯ", "ПСИХОЛОГИЯ", "КУЛЬТУРНЫЙ", "ФИЛОСОФИЯ", "ДОКТОРАНТ", "ТЕАТРАЛЬНЫЙ",
            "СЛОВАРЬ", "ФАНТАСТИКА", "КОМПЛЕКСНЫЙ", "ЭКОЛОГИЯ", "ПРОГРАММИРОВАНИЕ", "ДИРЕКТОРСКИЙ",
            "ОРГАНИЗАЦИЯ", "ТЕХНОЛОГИЯ", "КОНФЕРЕНЦИЯ", "ТРАДИЦИОННЫЙ", "КОНСТРУКТОР", "МАТЕМАТИКА",
            "ПЕДАГОГИКА", "МЕЖДУНАРОДНЫЙ", "СПЕЦИАЛИСТ", "ПРИРОДОВЕДЕНИЕ", "ЭКСПЕРИМЕНТ", "СОЗИДАТЕЛЬ",
            "ДИЗАЙНЕРСКИЙ", "КРЕАТИВНЫЙ", "ИНФОРМАЦИЯ", "ПРОЕКТИРОВАНИЕ", "БИОЛОГИЯ", "ХИМИЧЕСКИЙ",
            "ФИНАНСОВЫЙ", "ЭКОНОМИКА", "КЛИМАТИЧЕСКИЙ", "ПРИЛОЖЕНИЕ", "РЕШЕНИЕ", "ЗАЩИТА", "АВИАЦИЯ",
            "КОНЦЕПЦИЯ", "ПРОДУКЦИЯ", "СОЗДАНИЕ", "РЕКЛАМА", "ЭНЦИКЛОПЕДИЯ", "ЖИВОПИСЬ"
    };

    public String getRandomWord() {
        int wordPos = (int) (Math.random() * WORDS.length);
        return WORDS[wordPos];
    }
}
